import { IData } from "../../components/historical-dates/historical-dates"

export const testData: IData[] = [
  {
    firstYear: "1957",
    secondYear: "1970",
    info: [
      {
        title: "1957",
        description: "Первый полет искусственного спутника земли «Спутник»",
      },
      {
        title: "1959",
        description:
          "Пролёт Луны автоматической межпланетной станцией «Луна-1»; первый искусственный спутник Солнца",
      },
      {
        title: "1961",
        description:
          "Первый полёт вокруг Земли космонавта Ю. А. Гагарина на корабле-спутнике «Восток»",
      },
      {
        title: "1966",
        description: "Первый искусственный спутник Луны — автоматическая станция «Луна-10»",
      },
      {
        title: "1970",
        description:
          "Мягкая посадка на поверхность Венеры автоматической станции «Венера-7» с научной аппаратурой",
      },
    ],
    paginationText: "Космос",
  },
  {
    firstYear: "2010",
    secondYear: "2016",
    info: [
      {
        title: "2010",
        description: "Снят первый в мире фильм IMini в жанре «хоррор» в формате 16D ",
      },
      {
        title: "2012",
        description:
          "Впервые в истории кинематографа применена технология захвата движения котиков для создания самого милого фильма",
      },
      {
        title: "2015",
        description:
          "Съемки фильма «Джон Вик» приостановились по причине того, что Джон не смог найти себе на главную роль нужного актера",
      },
      {
        title: "2016",
        description:
          "Лучшим фильмом по мнению интернета стал «Хороший мальчик», снятый по мотивом жизни обычного пса",
      },
    ],
    paginationText: "Кино",
  },
  {
    firstYear: "1618",
    secondYear: "1991",
    info: [
      {
        title: "1618",
        description:
          "Близ впадения реки Кондомы в реку Томь основан один из старейших городов в Сибири - Кузнецк",
      },
      {
        title: "1929",
        description:
          "Владимиром Маяковским написано стихотворение «Рассказ Хренова о Кузнецкстрое и о людях Кузнецка»",
      },
      {
        title: "1931",
        description:
          "Заработал Кузнецкий металлургический комбинат, который стал градообразующим предприятием",
      },
      {
        title: "1932",
        description: "Постановлением ВЦИК город Кузнецк был переименован в Сталинск",
      },
      {
        title: "1961 ",
        description: "Указом Президиума ВС РСФСР Сталинск вновь переименован в Новокузнецк",
      },
      {
        title: "1989 ",
        description: "Новокузнецк стал одним из центров забастовки горняков",
      },
    ],
    paginationText: "Новокузнецк",
  },
  {
    firstYear: "1950",
    secondYear: "1820",
    info: [
      {
        title: "1950",
        description:
          "На трассе «Сильверстоун» в британском Нортгемптоншире прошла первая гонка в истории «Формулы-1»",
      },
      {
        title: "1962",
        description: "Команда «Лотус» впервые использовала в конструкции автомобилей монокок",
      },
      {
        title: "1978",
        description:
          "«Лотус» впервые применила граунд-эффект, который увеличивал прижимную силу за счёт разреженного воздуха под днищем автомобиля",
      },
      {
        title: "1981",
        description:
          "Подписан первый Договора согласия — документ, регламентирующий отношения между командами Формулы-1 и FIA",
      },
    ],
    paginationText: "Формула\u00A01",
  },
  {
    firstYear: "1995",
    secondYear: "2015",
    info: [
      {
        title: "1995",
        description:
          "LiveScript переименовали в JavaScript, получив соответствующую лицензию у Sun",
      },
      {
        title: "1996",
        description: "Старт работ по стандартизации JavaScript по стандартам ECMA",
      },
      {
        title: "1999",
        description: "Выход ECMAScript 3, ставшим фундаментом для многих библиотек",
      },
      {
        title: "2008",
        description:
          "Завершена работа над ECMAScript 5, ставшим одной из самых поддерживаемых версий JavaScript",
      },
      {
        title: "2015",
        description:
          "Релиз ECMAScript 6 (ECMAScript 2015) - самое масштабное обновления языка JavaScript, увеличившее популярность языка",
      },
    ],
    paginationText: "JavaScript",
  },
  {
    firstYear: "2015",
    secondYear: "2022",
    info: [
      {
        title: "2015",
        description:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        title: "2016",
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        title: "2017",
        description:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        title: "2018",
        description:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        title: "2018",
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
    ],
    paginationText: "Наука",
  },
]
